{
  "vezbanja": [
    {
      "imePitanja": "Find a finite nominal clause in each of the given sentences and replace it with a NON-FINITE construction. Underline each of the non- finite constructions you have got, and indicate what kind of a non-finite construction it is as well as its function.",
      "pitanja": [
        "I asked an old guy who ran the gas station if the he had noticed anything suspicious the previous day.",
        "Neil Armstrong was the first person who landed on the moon.",
        "He reached out for the towel that hung on the rack over the tub.",
        "She remembered seeing the play before.",
        "Calling Scooby a detective is a compliment.",
        "Because she has just given up smoking, she is in a pretty bad mood.",
        "All drivers who exceed the speed limit will be fined.",
        "I would like that all my friends are happy.",
        "Because she had studied at Cambridge University, she found a job easily.",
        "Freedom means that you are true to yourself.",
        "He is the man you should contact about the issue.",
        "We all are surprised that he made that mistake.",
        "He was an astronaut and that accounts for the size of the audience.",
        "I was afraid that I might fall down the ladder.",
        "Living in the Mediterranean means that you can eat very healthy food.",
        "I don’t know where we should take them for dinner.",
        "Since I met you, I have been reading your books.",
        "E + J <3",
        "Ema pjincezica jocina",
        "Once this book is published, it will be very popular among the students",
        "After he had travelled round the world, he settled down to write his memoirs.",
        "Because there was no quorum, the meeting was postponed.",
        "They used powerful loudspeakers so that they could be heard all over the city centre.",
        "Because I was interested to see what would happen, I stayed till the end of the meeting.",
        "As he was brought up to believe that pleasures are sinful, he now leads an ascetic life.",
        "After the guests had departed, we resumed the normal household routine.",
        "After we had departed for Sydney, we realized that we had forgotten a suitcase back home.",
        "Since it has expired, the visa will have to be replaced with a new one. 2. Since my visa had expired, I had to obtain a new one.",
        "The rain having stopped, we set off for a long hike.",
        "He did not pass the test, unfortunately.",
        "Just before 9, having checked the time on his watch, he drank up his last drop of brandy.",
        "Though the church was large, every seat was occupied Precisely at 2:30 someone knocked on the door.",
        "Dan nearly missed his flight, owing to a traffic snarl-up."
      ]
    },
    {
      "imePitanja": "Identify the pattern of the following sentences and indicate their functional elements. Underline the formal/functional units.",
      "pitanja": [
        "The department meeting will be in an hour.",
        "That’s the guy that she loved desperately",
        "The girl was a rather short, sullen-looking young woman of twenty-seven.",
        "The usual fishing grounds are a long way to the south.",
        "Her revenge would be to talk with Jackson about Mrs. O",
        "The dwarfs Snow White met when she woke up were funny but friendly creatures.",
        "My cousin Mary, who was here last year, has become quite a good-looking girl.",
        "Being uncertain of his abilities, the new employee felt cautious about taking the risk.",
        "The failure to conclude the trade talks last December with those financial institutions we heavily rely on in our monetary policy could prove a blessing in disguise.",
        "For the following four days, while the others had a great, robust time golfing and boozing it up, I was the object of expressions of pity and solemn, perfunctory commiseration from many people I hate and wanted to hit and scream at.",
        "The apprentice looks careful.",
        "The apprentice looked carefully at the new machine.",
        "The girl turned red at the thought",
        "He proved his cause.",
        "He proved true to his cause.",
        "Her explanation proved beyond my understanding.",
        "I remembered it was Sunday morning.",
        "They called him George.",
        "She soon convinced me that her dealings were safe.",
        "I want my coffee strong.",
        "E + J <3",
        "Em krem kekerem",
        "The following tips will hopefully teach everyone interested how to unleash their own inborn charm and use it for their advantage regardless of whether they’re entering a brief affair or sustaining a long-term relationship",
        "The sullen murmur of the bees shouldering their way through the long unmown grass made the stillness even more opressive than ever it had been.",
        "In my dream, I had a very vivid picture of where we used to live in those happy days when everything seemed right and everyone seemed satisfied.",
        "i gave my father the manuscript of a story based on an old family feud.",
        "For years I had been making him proud just by sending along the clippings.",
        "The facts I had begun my story with were these.",
        "Mark has been smoking on and off for two years, never trying to quit. She never dreamed her eldest son would be smoking at the age of eleven.",
        "Willard asked Cobb if he thought she was dead."
      ]
    }
  ]
}
